backend/app/controllers/user_controller.rb

INSERT INTO `users` (`username`, `email_address`, `phone_number`, `salt`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('amg380', 'anish.goyal@rutgers.edu', '7329797205', '$2a$10$qag//zyb7iLqnX40HSLC0u', '$2a$10$qag//zyb7iLqnX40HSLC0urYFhFUXVSCkADg5aPVxU.q37IPDtnEK', '2015-10-04 00:31:49', '2015-10-04 00:31:49')
---
	def create
		user = User.new()

        user.username = params[:username]
        user.password = params[:password]
        user.password_confirmation = params[:password_confirmation]
        user.email_address = params[:email_address]
        user.first_name = params[:first_name]
        user.last_name = params[:last_name]
        user.activation = SecureRandom.hex 16

		if user.save()